Австралия/src/AccumulationRegisters/SerialNumbers/SerialNumbers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>SerialNumbers</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ownership</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SerialNumber</name>
    <type>
      <types>CatalogRef.SerialNumbers</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/SerialNumbers/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Procedure creates an empty temporary table of records change.
//
Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If NOT AdditionalProperties.Property("ForPosting")
	 OR NOT AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	SerialNumbers.LineNumber AS LineNumber,
	|	SerialNumbers.Products AS Products,
	|	SerialNumbers.Characteristic AS Characteristic,
	|	SerialNumbers.Batch AS Batch,
	|	SerialNumbers.Ownership AS Ownership,
	|	SerialNumbers.SerialNumber AS SerialNumber,
	|	SerialNumbers.StructuralUnit AS StructuralUnit,
	|	SerialNumbers.Cell AS Cell,
	|	SerialNumbers.Quantity AS QuantityBeforeWrite,
	|	SerialNumbers.Quantity AS QuantityChange,
	|	SerialNumbers.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsSerialNumbersChange
	|FROM
	|	AccumulationRegister.SerialNumbers AS SerialNumbers");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsSerialNumbersChange", False);
	
EndProcedure

#EndRegion

#EndIf
